
##---------------딕셔너리---------------------##

inner = {"(반팔,긴팔) 티셔츠" : "모든 아우터의 이너로 입을 수 있습니다. 계절감을 고려하여 코디하시기 바랍니다.",
         "맨투맨" : "ma-1 , 숏패딩, (싱글,더블,발마칸) 코트, 후리스, 후드집업, 스타디움 자켓",
         "후드티" : "ma-1 , 숏패딩, 트랜치 코트, (싱글,더블,발마칸) 코트, 반코트, 후리스, 스타디움 자켓",
         "셔츠/블라우스" : "가디건, 베스트, 숏패딩, 블루종, 가죽자켓, 블레이져, 트랜치코트, (싱글,더블,발마칸) 코트 , 반코트",
         "니트" : "가디건 , 숏패딩, 가죽자켓 , 트랜치 코트, (싱글,더블,발마칸) 코트 + 이너로 입을 시에는 두깨감을 고려하세요.",
         "목폴라(티, 니트)" : "가디건, 아우터 셔츠, 베스트, 숏패딩, 블루종, 가죽자켓, 블래이져, 트랜치코트, (싱글,더블,발마칸)코트, 반코트, 무스탕, 스타디움 자켓 + 이너로 입을 시에는 두깨감을 고려하세요.",
         "카라 티셔츠" : "베스트, 숏패딩, 트랜치코트, (싱글,더블,발마칸) 코트, 후리스, 스타디움 자켓"};

outer = {"가디건" : "(반팔,긴팔)티셔츠, 셔츠/블라우스, 목폴라티 (두깨감 고려), 카라티셔츠 | 모든 아우터에 적용되는 부분이지만 이너의 사이즈를 아우터보다 반~한사이즈 크게 코디하시는 것을 권장드립니다.",
         "아우터 셔츠" : "(반팔,긴팔)티셔츠, 목폴라티, 카라 티셔츠",
         "ma-1" : "(반팔,긴팔)티셔츠, 맨투맨 , 목폴라티",
         "베스트" : "(반팔,긴팔)티셔츠 , 셔츠/블라우스 , 목폴라티",
         "숏패딩" : "대부분의 이너 위에 코디하실 수 있습니다. 다만 숏패딩도 코디의 일부분임을 늘 생각하시고 전체적인 색조합과 무드에 맞추어 코디하시기 바랍니다.",
         "블루종" : "(반팔,긴팔)티셔츠 , 후드티 , 셔츠 , 니트 , 목폴라티",
         "가죽자켓" : "(반팔,긴팔)티셔츠, 맨투맨, 후드티, 셔츠/블라우스, 니트, 목폴라티 | 정사이즈로 구매하시기보단 반~한사이즈 업하여 코디하시는 것이 보다 여유롭고 트랜디한 핏감을 연출하실 수 있습니다.",
         "블래이저" : "(반팔,긴팔)티셔츠 , 맨투맨 , 셔츠/블라우스 , 목폴라티",
         "트랜치코트" : "대부분의 이너 위에 코디하실 수 있습니다. 다만 트랜치코트의 무드에 맞는 이너를 코디해주시는 것이 중요하며 코트를 구입하실 때 너무 오버한 사이즈보단 정사이즈, 혹은 반사이즈업한 정도로 구입하시는 것을 추천드립니다.",
         "(싱글,더블,발마칸) 코트" : "대부분의 이너 위에 코디하실 수 있습니다. 다만 코트의 무드에 맞는 이너를 코디해주시는 것이 중요합니다. 또한 롱코트의 기장감을 많이 고민하시는데, 본인의 키에서 코트의 총기장을 뺀 값이 55-65cm 정도가 나오는 제품을 구매하시는 것을 추천드립니다.",
         "반코트" : "(반팔,긴팔)티셔츠 , 후드티 , 셔츠/블라우스 , 니트 , 목폴라티",
         "후리스" : "(반팔,긴팔)티셔츠 , 맨투맨 , 후드티",
         "후드집업" : "(반팔,긴팔)티셔츠 , 맨투맨 , 카라티셔츠",
         "무스탕" : "(반팔,긴팔)티셔츠 , 맨투맨 , 니트 , 목폴라티 | 무스탕은 그 자체로 포인트가 되는 아우터이기 때문에 상,하의를 베이직하게 깔아주시는 것을 추천드립니다.",
         "스타디움 자켓" : "(반팔,긴팔)티셔츠 , 맨투맨 , 후드티 | 스타디움 자켓은 한사이즈 정도 크게 코디하시는 것이 트랜디한 핏감을 연출하는데 도움이 됩니다."};

pants = {"데님 팬츠" : "대부분의 상의와 코디하여 입을 수 있습니다! 데님을 입으실때는 상의와의 색매치와핏감에 신경쓰시기 바랍니다.",
         "숏팬츠" : "반팔 티셔츠, 긴팔 티셔츠, 맨투맨, 후드티 + 전체적인 코디의 무드를 캐쥬얼하거나 스포티하게 가져가는 것을 추천합니다.",
         "코튼 팬츠" : "반팔 티셔츠, 긴팔 티셔츠, 맨투맨, 셔츠, 니트, 목폴라티, 카라티셔츠",
         "레깅스" : "반팔 티셔츠, 긴팔티셔츠, 맨투맨, 후드티 + 레깅스가 하체라인을 완전히 드러내기 때문에 상의의 핏감은 함께 타이트하게 가시거나 오버한 핏으로 연출하시는 것을 추천합니다.",
         "슬랙스" : "대부분의 상의와 코디하여 입을 수 있습니다! 다만 슬랙스가 주는 무드에 맞추어 너무 스트릿하거나 스포티한 상의는 피하여 코디하시는 것을 추천합니다.",
         "트레이닝 팬츠" : "반팔 티셔츠, 긴팔 티셔츠, 맨투맨, 후드티, 카라티셔츠 | 일반적으로 편안한 무드로 연출할 수 있는 하의지만 와이드한 트레이닝 팬츠일 경우 추천 상의 외에 오버핏의 셔츠나 니트를 매치하셔도 꾸안꾸 코디를 연출하실 수 있습니다.",
         "조거팬츠" : "반팔 티셔츠, 긴팔 티셔츠, 맨투맨, 후드티",
         "숏 스커트" : "대부분의 상의와 코디하여 입을 수 있습니다! 다만 스커트의 제질을 상의의 무드와 어울리게 코디하시는 것을 추천드립니다. (예시: 후드티 + 테니스스커트, 블라우스 + 니트, 정장 스커트, 맨투맨 + 데님스커트)",
         "롱스커트" : "반팔 티셔츠, 긴팔 티셔츠, 셔츠/블라우스, 니트, 목폴라티 | 스커트의 핏감과 상의 핏감을 비슷하게 코디하시는 것을 추천드립니다."};

Bcolor = { "흰색" : "대부분의 색상과 어울립니다! 코디에 흰색을 섞어주면 전체적인 코디를 보다 깔끔하게 만들어줄 수 있습니다.",
           "검은색" : "대부분의 색상과 어울립니다! 코디의 베이스로 검은색을 깔아두고 한가지의 색상으로 포인트를 주는 코디를 하면 안정적으로 코디할 수 있습니다.",
           "네이비 상의" : "연청 베이지 크림색 카키색 회색",
           "초록색 상의" : "연청 검은색 베이지",
           "노랑색 상의" : "진청 검은색 베이지",
           "주황색 상의" : "진청 검은색 브라운",
           "파란색 상의" : "진청 검은색",
           "갈색 상의" : "진청 검은색 베이지 크림색 회색",
           "베이지색 상의" : "진청 검은색 크림색 카키색",
           "빨간색 상의" : "연청 검은색 크림색 회색",
           "흰색 상의" : "대부분의 하의와 어울립니다 ! 다만 흰색 바지를 조합하는 것은 피해주세요.",
           "은색 상의" : "대부분의 하의와 어울립니다 ! 다만 흰색 바지를 조합하는 것은 피해주세요.",
           "회색 상의" : "연청 진청 검은색"};

TonTcolor = {"붉은색 계열" : "버건디, 적색, 다홍색, 연분홍, 베이지, 적갈색, 회갈색, 카키베이지",
             "주황색 계열" : "주황색, 연주황, 살구색, 아이보리, 연갈색, 갈색, 고동색, 짙은 갈색",
             "노랑색 계열" : "노란색, 머스타드색, 아이보리, 상아색, 갈색, 녹차색",
             "초록색 계열" : "초록색, 짙은 초록색, 연두색, 민트색, 짙은 민트색, 카키색",
             "푸른색 계열" : "파란색, 짙은 청색, 하늘색, 바다색, 네이비, 짙은 네이비",
             "보라색 계열" : "보라색, 연보라색, 짙은 자색, 바이올렛, 라밴더"};




##----------------메인 코드 부분----------------##


while(True):
        print("~데일리 패션 코디 도우미~\n\n메뉴를 선택하세요.\n1. 코디\n2. 색상조합\n3. 끝내기")
        User_input = input("\n메뉴 번호 입력 :")

        if User_input == '1' :   #코디------------------------------------
            print("1.상의\n2.하의\n3.돌아가기")
            Cloth_input = input("\n메뉴 번호 입력 :")

            if Cloth_input == '1' :  #상의-시작------------------------
                print("1.이너\n2.아우터\n3.돌아가기")
                Top_input = input("\n메뉴 번호 입력 :")
                if Top_input == '1' :  #이너-시작-----------------------
                    while(True):
                        myinner = input(str(list(inner.keys())) + "중 코디를 알아볼 옷은?")
                        if myinner in inner :
                            print("<%s> 궁합 아우터는 <%s>" %(myinner, inner.get(myinner)))

                        elif myinner == "끝" :
                            break

                        else :
                            print("옷이 목록에 없습니다. 확인해 보세요.")
                            break  #이너-끝----------

                if Top_input == '2' : #아우터-시작----------
                    while(True):
                        myouter = input(str(list(outer.keys())) + "중 코디를 알아볼 옷은?")
                        if myouter in outer :
                            print("<%s> 궁합 이너는 <%s>" %(myouter, outer.get(myouter)))
                            
                        elif myouter == "끝" :
                            break

                        else :
                            print("옷이 목록에 없습니다. 확인해 보세요.")
                            break #아우터-끝--------------
                        
                if Top_input == '3' :
                    continue

        #------------------하의--------------------

            if Cloth_input == '2' :
                while(True):
                    mypants = input(str(list(pants.keys())) + "중 코디를 알아볼 옷은?")
                    if mypants in pants :
                        print("<%s> 궁합 상의는 <%s>" %(mypants, pants.get(mypants)))

                    elif mypants == "끝" :
                        break

                    else :
                        print("옷이 목록에 없습니다. 확인해 보세요.")
                        break

            if Cloth_input == '3' :
                continue #코디-종료-----------

                   
        #----------------색상조합-----------------
        if User_input == '2' :
            print("1.기본 색상조합\n2.톤온톤\n3.톤인톤\n4.돌아가기")
            Color_input = input("\n메뉴 번호 입력 :")
            if Color_input == '1' :
                while(True):
                    myBcolor = input(str(list(Bcolor.keys())) + "중 조합을 알아볼 색상은?")
                    if myBcolor in Bcolor :
                        print("<%s> 궁합 색상은 <%s>" %(myBcolor, Bcolor.get(myBcolor)))

                    elif myBcolor == "끝" :
                        break

                    else :
                        print("색상이 목록에 없습니다. 확인해 보세요.")
                        break

            if Color_input == '2' :
                print("톤온톤: 동일 계열의 색상 안에서 색상의 진함과 연함에 그라데이션을 주는 방식입니다.\n전체적인 코디에 안정감을 줄 수 있습니다.")
                while(True):
                    myTonTcolor = input(str(list(TonTcolor.keys())) + "중 조합을 알아볼 색상은?")
                    if myTonTcolor in TonTcolor :
                        print("<%s> 궁합 색상은 <%s>입니다." %(myTonTcolor, TonTcolor.get(myTonTcolor)))

                    elif myBcolor == "끝" :
                        break

                    else :
                        print("색이 목록에 없습니다. 확인해 보세요.")
                        break

                

            if Color_input == '3' :
                print("톤인톤은 팝업되는 색상표에서 가로줄의 색상끼리 조합하는 코디법입니다.")
                import webbrowser
                url = "https://ifh.cc/g/xZknvb.jpg"
                webbrowser.open(url)
                True


            if Color_input == '4' :
                continue #색상조합-종료-----------


        if User_input == '3' :
            break

















        












    
